{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2024-07-09T15:38:15.4560663Z",
  "creationSource": null,
  "description": "Configures OneDrive KFM + additional OneDrive settings.",
  "lastModifiedDateTime": "2024-07-09T15:38:15.4560663Z",
  "name": "PROD - Win11 - Catalog - Device - OneDrive",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": ["0"],
  "settingCount": 18,
  "technologies": "mdm",
  "id": "c1d4e388-a85a-4cab-affd-5fe6ab825bce",
  "templateReference":
    {
      "templateId": "",
      "templateFamily": "none",
      "templateDisplayName": null,
      "templateDisplayVersion": null,
    },
  "settings":
    [
      {
        "id": "0",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_allowtenantlist",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_allowtenantlist_1",
                "children":
                  [
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                      "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_allowtenantlist_allowtenantlistbox",
                      "settingInstanceTemplateReference": null,
                      "simpleSettingCollectionValue":
                        [
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                            "settingValueTemplateReference": null,
                            "value": "0000000-0000000000-000000000-0000000000",
                          },
                        ],
                    },
                  ],
              },
          },
      },
      {
        "id": "1",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_mindiskspacelimitinmb",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_mindiskspacelimitinmb_1",
                "children":
                  [
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                      "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_mindiskspacelimitinmb_mindiskspacemb",
                      "settingInstanceTemplateReference": null,
                      "simpleSettingValue":
                        {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                          "settingValueTemplateReference": null,
                          "value": 2000,
                        },
                    },
                  ],
              },
          },
      },
      {
        "id": "2",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_dehydratesyncedteamsites",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_dehydratesyncedteamsites_1",
                "children": [],
              },
          },
      },
      {
        "id": "3",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablefretutorial",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablefretutorial_1",
                "children": [],
              },
          },
      },
      {
        "id": "4",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_enablesyncadminreports",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_enablesyncadminreports_1",
                "children": [],
              },
          },
      },
      {
        "id": "5",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv4~policy~onedrivengsc_enableodignorelistfromgpo",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv4~policy~onedrivengsc_enableodignorelistfromgpo_1",
                "children":
                  [
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                      "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv4~policy~onedrivengsc_enableodignorelistfromgpo_enableodignorelistfromgpolistbox",
                      "settingInstanceTemplateReference": null,
                      "simpleSettingCollectionValue":
                        [
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                            "settingValueTemplateReference": null,
                            "value": "*.lnk",
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                            "settingValueTemplateReference": null,
                            "value": "*.pst",
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                            "settingValueTemplateReference": null,
                            "value": "*.url",
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                            "settingValueTemplateReference": null,
                            "value": "*.exe",
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                            "settingValueTemplateReference": null,
                            "value": "*.msi",
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                            "settingValueTemplateReference": null,
                            "value": "*.appx",
                          },
                        ],
                    },
                  ],
              },
          },
      },
      {
        "id": "6",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv4~policy~onedrivengsc_disablefirstdeletedialog",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv4~policy~onedrivengsc_disablefirstdeletedialog_1",
                "children": [],
              },
          },
      },
      {
        "id": "7",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmblockoptout",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmblockoptout_1",
                "children": [],
              },
          },
      },
      {
        "id": "8",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_blockexternalsync",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_blockexternalsync_1",
                "children": [],
              },
          },
      },
      {
        "id": "9",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepersonalsync",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepersonalsync_1",
                "children": [],
              },
          },
      },
      {
        "id": "10",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_localmassdeletefiledeletethreshold",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_localmassdeletefiledeletethreshold_1",
                "children":
                  [
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                      "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_localmassdeletefiledeletethreshold_lmdfiledeletethresholdbox",
                      "settingInstanceTemplateReference": null,
                      "simpleSettingValue":
                        {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                          "settingValueTemplateReference": null,
                          "value": 50,
                        },
                    },
                  ],
              },
          },
      },
      {
        "id": "11",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection_1",
                "children": [],
              },
          },
      },
      {
        "id": "12",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_gposetupdatering",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_gposetupdatering_1",
                "children":
                  [
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                      "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_gposetupdatering_gposetupdatering_dropdown",
                      "settingInstanceTemplateReference": null,
                      "choiceSettingValue":
                        {
                          "settingValueTemplateReference": null,
                          "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_gposetupdatering_gposetupdatering_dropdown_5",
                          "children": [],
                        },
                    },
                  ],
              },
          },
      },
      {
        "id": "13",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_1",
                "children":
                  [
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                      "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_desktop_checkbox",
                      "settingInstanceTemplateReference": null,
                      "choiceSettingValue":
                        {
                          "settingValueTemplateReference": null,
                          "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_desktop_checkbox_1",
                          "children": [],
                        },
                    },
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                      "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_documents_checkbox",
                      "settingInstanceTemplateReference": null,
                      "choiceSettingValue":
                        {
                          "settingValueTemplateReference": null,
                          "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_documents_checkbox_1",
                          "children": [],
                        },
                    },
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                      "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_pictures_checkbox",
                      "settingInstanceTemplateReference": null,
                      "choiceSettingValue":
                        {
                          "settingValueTemplateReference": null,
                          "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_pictures_checkbox_1",
                          "children": [],
                        },
                    },
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                      "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown",
                      "settingInstanceTemplateReference": null,
                      "choiceSettingValue":
                        {
                          "settingValueTemplateReference": null,
                          "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown_1",
                          "children": [],
                        },
                    },
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                      "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_textbox",
                      "settingInstanceTemplateReference": null,
                      "simpleSettingValue":
                        {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "0000000-0000000000-000000000-0000000000",
                        },
                    },
                  ],
              },
          },
      },
      {
        "id": "14",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig_1",
                "children": [],
              },
          },
      },
      {
        "id": "15",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports_1",
                "children":
                  [
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                      "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports_syncadminreports_textbox",
                      "settingInstanceTemplateReference": null,
                      "simpleSettingValue":
                        {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "0000000-0000000000-000000000-0000000000",
                        },
                    },
                  ],
              },
          },
      },
      {
        "id": "16",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled_1",
                "children": [],
              },
          },
      },
      {
        "id": "17",
        "settingInstance":
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb",
            "settingInstanceTemplateReference": null,
            "choiceSettingValue":
              {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb_1",
                "children":
                  [
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                      "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb_warningmindiskspacemb",
                      "settingInstanceTemplateReference": null,
                      "simpleSettingValue":
                        {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                          "settingValueTemplateReference": null,
                          "value": 5000,
                        },
                    },
                  ],
              },
          },
      },
    ],
}
